[
  {
    "Job Title": "Frontend Developer",
    "Company Name": "Neridio Systems",
    "Location": "Bengaluru(Arekere)",
    "Experience Required": "0 Yrs",
    "Salary": "Not disclosed",
    "Application Type": "Internal",
    "Job URL": "https://www.naukri.com/job-listings-frontend-developer-neridio-systems-bengaluru-0-to-0-years-080425008002",
    "Scraped Date": "2025-05-04T03:35:21.105Z",
    "Skills": "Node.Js, React.Js, Javascript, JQuery, Expresjs, Html/Css, Frontend Development, Front end",
    "Job Description": "We're Hiring! Frontend Developer (React.js + Node.js) – 2023 & 2024 Passout Welcome.\nWe are looking for enthusiastic and talented individuals who are passionate about frontend technologies and eager to grow with a dynamic team."
  },
  {
    "Job Title": "Frontend Developer",
    "Company Name": "Advanced Structures India",
    "Location": "Bengaluru",
    "Experience Required": "0-2 Yrs",
    "Salary": "Not disclosed",
    "Application Type": "External",
    "Job URL": "https://www.naukri.com/job-listings-frontend-developer-advanced-structures-india-private-limited-bengaluru-0-to-2-years-170125505091",
    "Scraped Date": "2025-05-04T03:35:28.571Z",
    "Skills": "Backend, Version control, GIT, Front end, Agile, Javascript, data visualization, Automotive, Consumer electronics, CSS3",
    "Job Description": "As a Frontend Developer, you will play a key role in designing and implementing responsive, intuitive, and high-performing web applications that empower users and leverage advanced AI features.\n\nKey Responsibilities\nBuild and maintain responsive, user-friendly interfaces using React, Redux , and Next.js .\nCollaborate with backend developers to ensure seamless integration of APIs and AI-powered features.\nOptimize web applications for performance, scalability , and usability .\nWork with UX/UI designers to turn wireframes and mock-ups into engaging, interactive experiences.\nApply best practices in front-end development, emphasizing code reusability and modular design .\nDebug, troubleshoot, and upgrade existing applications to maintain reliability and consistency.\n\nQualifications\n2+ years of experience in frontend development with React, Redux, and Next.js.\nStrong understanding of JavaScript, HTML5, and CSS3.\nExperience with state management using Redux and asynchronous data fetching.\nFamiliarity with version control tools like Git.\nAbility to collaborate in an agile environment and communicate effectively across teams.\nFamiliarity with modern front-end build pipelines and tools.\n\nSkills that give you an edge\nExperience working with AI-driven features or data visualization.\nUnderstanding of backend technologies and RESTful APIs.\nKnowledge of frontend testing frameworks like Jest or Mocha.\nExperience with CSS pre-processors like SASS or styled- components."
  },
  {
    "Job Title": "Frontend Developer Intern",
    "Company Name": "Promilo",
    "Location": "Bengaluru",
    "Experience Required": "0-1 Yrs",
    "Salary": "Not disclosed",
    "Application Type": "Internal",
    "Job URL": "https://www.naukri.com/job-listings-frontend-developer-intern-promilo-bengaluru-0-to-1-years-290425904044",
    "Scraped Date": "2025-05-04T03:35:36.110Z",
    "Skills": "Java, CSS, HTML, Python, Debugging tools, Restful API, Javascript, Tools",
    "Job Description": "Location: Bangalore Work from Office Only\n\nJob Type: Internship\n\nAbout the Company:\nSawara Solutions Pvt. Ltd. (Promilo.com) is a Bangalore-based organization connecting individuals, professionals, and organizations worldwide through product demos and image showcases. They aim to create a global community and opportunities for everyone with online business connections.\nPromilo.com is a new online business community connecting people and creating new business opportunities.\n\nJob Summary:\nWe are seeking a passionate and talented Frontend Developer Intern to join our dynamic team. In this role, you will work closely with our design and development teams to build visually stunning and highly functional user interfaces for our online platforms. This opportunity is ideal for individuals eager to gain hands-on experience in frontend development and contribute to impactful projects.\n\nRoles and Responsibilities:\n\nCollaborate with designers and backend developers to create responsive and user-friendly web interfaces.\nDevelop and maintain features using HTML, CSS, and JavaScript frameworks.\nOptimize web applications for performance, scalability, and cross-browser compatibility.\nWrite clean, maintainable, and reusable code while adhering to best practices.\nDebug and resolve UI/UX issues to ensure a seamless user experience.\nParticipate in daily standups, code reviews, and brainstorming sessions to contribute ideas and feedback.\n\nEducation:\nRecently completed a degree in B tech, M tech, BCA, MCA\n\nRequired Skills: Java, Python,HTML,CSS,Javascript,Restful API's.\nRole: Frontend Developer Intern\nType: Internet & Dot com Industry | Educational & Job portal company will be an added advantage\nArea: IT Department\nEmployment Type: Internship\nRole Category:Frontend Developer Intern\nLocation: Work from Office (Bengaluru)\nEducation:Recently completed a degree in B tech, M tech, BCA, MCA"
  },
  {
    "Job Title": "Frontend Developer React Ecosystem",
    "Company Name": "tailored ai",
    "Location": "Bengaluru",
    "Experience Required": "0-2 Yrs",
    "Salary": "8-14 Lacs PA",
    "Application Type": "Internal",
    "Job URL": "https://www.naukri.com/job-listings-frontend-developer-react-ecosystem-dayworks-bengaluru-0-to-2-years-250425012842",
    "Scraped Date": "2025-05-04T03:35:43.653Z",
    "Skills": "ReactJS, React Native, Front End",
    "Job Description": "This role is for one of the Weekday's clients\nSalary range: Rs 800000 - Rs 1400000 (ie INR 8-14 LPA)\nMin Experience: 0 years\nLocation: Bengaluru\nJobType: full-time\nWe are seeking an enthusiastic and detail-oriented Frontend Developer React Ecosystem to join our growing product engineering team. This is an excellent opportunity for someone who is passionate about building modern, high-performance mobile and web applications using React Native and ReactJS. Whether you're a recent graduate or someone with a few months of hands-on experience, we’re looking for individuals with a strong understanding of frontend development principles and a desire to grow in a fast-paced, collaborative environment.\n\nRequirements\nWhat You'll Do:\nBuild intuitive and responsive user interfaces for mobile applications using React Native.\nDevelop dynamic web applications using ReactJS, HTML5, and CSS3.\nCollaborate with product managers, designers, and backend developers to deliver high-quality features.\nWrite clean, reusable, and well-documented code following industry best practices.\nParticipate in code reviews, brainstorming sessions, and team discussions to continuously improve product quality and user experience.\nIdentify and troubleshoot UI/UX issues and performance bottlenecks across platforms and devices.\nStay updated with the latest trends and advancements in React and frontend technologies.\nMust-Have Skills:\nStrong knowledge of JavaScript (ES6+), ReactJS, and React Native.\nUnderstanding of component-based architecture and React state management techniques (e.g., hooks, context API).\nFamiliarity with RESTful APIs and asynchronous request handling.\nBasic understanding of mobile-first and responsive design principles.\nSolid grasp of HTML5, CSS3, and cross-browser compatibility issues.\nA good sense of design, UX principles, and attention to detail.\nGood to Have:\nExperience with version control systems like Git.\nExposure to mobile development environments (Xcode/Android Studio).\nFamiliarity with tools like Redux, Tailwind CSS, or Styled Components.\nExperience working on personal or open-source projects using React Native or ReactJS.\nUnderstanding of basic backend concepts (Node.js, APIs, etc.) is a plus.\nWho You Are:\nA self-starter who’s eager to learn and build real-world applications.\nCurious, collaborative, and comfortable with problem-solving.\nOpen to feedback and excited to grow as a frontend engineer.\nComfortable working in a team and communicating ideas clearly."
  },
  {
    "Job Title": "Frontend Developer - ReactJS",
    "Company Name": "Tunerlabs",
    "Location": "Bengaluru",
    "Experience Required": "0-2 Yrs",
    "Salary": "Not disclosed",
    "Application Type": "External",
    "Job URL": "https://www.naukri.com/job-listings-frontend-developer-reactjs-tunerlabs-bengaluru-0-to-2-years-070224501406",
    "Scraped Date": "2025-05-04T03:35:51.122Z",
    "Skills": "Front end, Javascript, React.js, Frontend Development, Development, End, Front",
    "Job Description": "We are looking for a skilled React js Developer to join our front-end development team\nIn this role, you will be responsible for developing and implementing user interface components using Reac js concepts and workflows such as Redux, Flux, and Webpack\nYou will also be responsible for profiling and improving front-end performance and documenting our front-end codebase"
  },
  {
    "Job Title": "Frontend Developer - AngularJS",
    "Company Name": "Tunerlabs",
    "Location": "Bengaluru",
    "Experience Required": "0-2 Yrs",
    "Salary": "Not disclosed",
    "Application Type": "External",
    "Job URL": "https://www.naukri.com/job-listings-frontend-developer-angularjs-tunerlabs-bengaluru-0-to-2-years-070224501405",
    "Scraped Date": "2025-05-04T03:35:58.482Z",
    "Skills": "Web technologies, Front end, Coding, Javascript, angularjs, Front, End, Development",
    "Job Description": "We are looking to hire an experienced AngularJS Developer to join our dynamic team\nAs a lead Developer, you will be responsible for creating a top-level coding-base using Angular best practices\nYour role will require you to implement an exciting and streamlined user experience in the form of a Javascript-based desktop and mobile web-app"
  },
  {
    "Job Title": "Front - End Developer",
    "Company Name": "Supercode",
    "Location": "Bengaluru",
    "Experience Required": "0-1 Yrs",
    "Salary": "Not disclosed",
    "Application Type": "External",
    "Job URL": "https://www.naukri.com/job-listings-front-end-developer-supercode-bengaluru-0-to-1-years-180124500910",
    "Scraped Date": "2025-05-04T03:36:06.005Z",
    "Skills": "Backend, jQuery, Front end, Web technologies, Wordpress, Web development, Javascript, CMS, PHP, HTML",
    "Job Description": "We are looking for a talented Frontend Developer to join our team and help us create stunning and seamless user interfaces.\nThe ideal candidate is passionate about web development, has a keen eye for design, and is well-versed in the latest frontend technologies.\nAs a Frontend Developer at Supercode Design, you will collaborate with cross-functional teams to bring our web applications to life and contribute to the overall success of our projects.\nJob Responsibilities\nCollaborate with cross-functional teams, including designers and backend developers, to implement engaging user interfaces for web applications.\nDevelop and maintain web applications using HTML, CSS, Javascript and JQuery.\nDeveloper PHP based website using WordPress as a CMS.\nDevelop sites using React frameworks such as Next.js.\nOptimise web pages for maximum speed and scalability, ensuring high performance across various devices and browsers.\nImplement responsive design principles to create seamless user experiences on both desktop and mobile platforms.\nUtilise industry best practices for code versioning, and collaboration.\nWork with design tools such as Figma to transform wireframes and design concepts into functional and visually appealing web applications.\nConduct performance audits using tools like Google Lighthouse to identify and address performance bottlenecks.\nImplement web animations using Three.js, GSAP, Framer Motion, or other relevant libraries to enhance user interactions and overall visual appeal."
  },
  {
    "Job Title": "Developer - Frontend",
    "Company Name": "Kanini Software Solutions",
    "Location": "Pune, Chennai, Bengaluru, Noida, Coimbatore",
    "Experience Required": "0-5 Yrs",
    "Salary": "Not disclosed",
    "Application Type": "External",
    "Job URL": "https://www.naukri.com/job-listings-developer-frontend-kanini-software-solutions-india-private-limited-noida-pune-chennai-coimbatore-bengaluru-0-to-5-years-051224500318",
    "Scraped Date": "2025-05-04T03:36:13.455Z",
    "Skills": "Content management, Front end, Project management, Web development, Javascript, Animation, SEO, Adobe, Analytics, CSS3",
    "Job Description": "Define, design, anddevelop business solutions through configuration and software development. Collaboratewith analysts and architects to define the technical direction. This requires adeep understanding of the business requirements that drive the analysis anddesign of these technical solutions.\n\nYou are someone who can:\n\nSupport and create engaging/modern user experiencesper stakeholder s specifications in the form of clean, W3C-compliant front-endcode. Focusing on web-standards, semantics, usability, accessibility, andoptimization, with special consideration given to code architecture, modularity,and reusability.\nAnalytics tagging implementation.\nTesting and documentation.\nAid and advise on processes, technology, and toolsused for custom web development.\nBe a point of contact for cross-functionaltechnical projects and programs. These include project/program execution,requirements gathering, technical execution and deployment.\nSupport platform and IT related needs, such asproduct updates and site administration.\nIdentify improvements within the creative marketingprocess and capabilities.\n\nYou bring in:\n\n3 or more years of technical product and projectexperience delivering best-in-class digital media experiences, preferably aspart of a team designing, developing and managing external business websites.\n3 or more years of experience as a web developer,high-level proficiency in HTML5, CSS3, and JavaScript. It is not enough toimplement a solution but to implement the best solution for a given context(You don t only know the how but the why).\nKnowledge of UX, SEO, and performance bestpractices.\nFamiliarity with software repositories and othertechnical collaboration tools.\nExperience with Content Management Systems (AdobeExperience Manager and Adobe Marketing Cloud tools experience preferred but notrequired).\nAbility to communicate priorities, mitigateimpacts, and manage multiple technical projects especially when requirementschange as new business discoveries or industry compliance dictate.\nStrong people skills working with colleagues,project management, business stakeholders and technical advisors.\nContinuous curiosity and love for learning.\nLimited sponsorship may be available.\nExperience with JavaScript frameworks (React.js or Angular)\nExperience with CSS frameworks (Bootstrap,Foundation)\nExperience with CSS preprocessors (SCSS, Sass)\nBEM methodology knowledge\nExperience with data visualization libraries (D3.jspreferred)\nSVG animation experience\nKnowledge of the agile methodology\n\nYour qualificationis:\n\nB.E/B.Tech/M.C.A/MSc(preferably in Computer Science/IT)"
  },
  {
    "Job Title": "Freshers - Software Engineer (MERN Stack), Bangalore",
    "Company Name": "Talent Bee Consulting",
    "Location": "Bengaluru",
    "Experience Required": "0-1 Yrs",
    "Salary": "3-3.5 Lacs PA",
    "Application Type": "Internal",
    "Job URL": "https://www.naukri.com/job-listings-freshers-software-engineer-mern-stack-bangalore-talent-bee-consulting-bengaluru-0-to-1-years-230425022895",
    "Scraped Date": "2025-05-04T03:36:20.962Z",
    "Skills": "Mern Stack, Full Stack Application Development, Node.Js, MongoDB, React.Js, Express, Frontend Development, Development",
    "Job Description": "ORG : A Software services and product company founded in 2013\n\nROLE: Responsible for designing, developing, and implementing frontend code using REACT and NODE.Js\n\nSKILLS:\n\n- React.Js (Very Good)\n- Node.Js (Good)\n- Python (good to have)\n\nRequired Candidate profile\n- Good coding skills in REACT\n- HTML5, CSS3, TypeScript, and JavaScript.\n- Knowledge of server-side development using Node.js or similar\n- English Fluency\n\nOK to work from office (RT Nagar, Bangalore)"
  },
  {
    "Job Title": "Store Front Associate (Contract)",
    "Company Name": "Allen Digital",
    "Location": "Bengaluru",
    "Experience Required": "0-2 Yrs",
    "Salary": "Not disclosed",
    "Application Type": "Internal",
    "Job URL": "https://www.naukri.com/job-listings-store-front-associate-contract-allen-digital-bengaluru-0-to-2-years-300425914149",
    "Scraped Date": "2025-05-04T03:36:29.720Z",
    "Skills": "json, html, api, web technologies, product operations, c++, css, web services, jsp, program management, manual testing, jquery, java, product management, xml, multithreading, jira, c#, rest, project management, c, management skills, wxwidgets, javascript, sql server, agile",
    "Job Description": "About ALLEN.\nAfter dominating the offline market of Tutoring, Allen Careers has set out to build the next big thing to happen to Education.\nAllen Digital aims to build an EdTech platform to provide students with everything that a classroom cannot.\nAllen Digital was created as a strategic partnership between Allen Careers Institute and Bodhi Tree Systems to ensure tech enablement for millions of students.\nWe are backed by some of the best names in media, business, education, and technology.\nThis is a start-up, which has a reputed team, strong investors, and a legacy.\nIf building 0 to 1 excites you and you want to work with a team of proven leaders, please reach out to us..\nKey Responsibilities.\nWork closely with the Product and Business teams to understand the requirements for app and website layout changes and adjustments..\nImplement changes and manage the layout and functionality of the website and app, ensuring a seamless and uniform experience across.\nKeep a track of all configurations and regularly update and modify widgets, banners as per course to reflect the latest relevant information, ensuring accuracy and relevance..\nRegularly test and monitor the website and app for functionality, layout consistency, and performance across different browsers and devices..\nCollaborate with the engineering team to troubleshoot and address any backend issues impacting frontend display or app behavior..\nBe the subject matter expert on different pages, widgets and their behaviour and thus be the POC for any discussions around improving the UI/UX.\nQualifications.\n2+ years of experience in website/app layout management and/or product operations.\nAbility to implement and maintain precise layout configurations, ensuring the correct configs of course, streams, and content combinations..\nBasic Understanding of JSON/ HTML/ APIs to make minor modifications independently.\nStakeholder and program management skills to work closely with Product, Business, and Technical teams to implement changes..\nAbility to interpret user feedback and apply it to enhance the overall user experience on the platform.."
  },
  {
    "Job Title": "PHP Developer (Laravel / CodeIgniter / WordPress)",
    "Company Name": "Sevenpris Brado",
    "Location": "Hybrid - Hyderabad, Chennai, Bengaluru",
    "Experience Required": "0-5 Yrs",
    "Salary": "2.5-6 Lacs PA",
    "Application Type": "Internal",
    "Job URL": "https://www.naukri.com/job-listings-php-developer-laravel-codeigniter-wordpress-sevenpris-brado-hyderabad-chennai-bengaluru-0-to-5-years-110425012006",
    "Scraped Date": "2025-05-04T03:36:44.958Z",
    "Skills": "Github, PHP, Laravel, GIT, Woocommerce, Wordpress, MySQL, Javascript, Version Control, Flutter, Codeigniter, Ajax",
    "Job Description": "Hiring PHP Developer with strong skills in PHP, Laravel, CodeIgniter, WordPress, GitHub, frontend & backend development. Flutter knowledge is a plus. Apply now to join a dynamic team and work on exciting projects!"
  },
  {
    "Job Title": "Associate Software Engineer",
    "Company Name": "COEDLOITE GLOBAL SOLUTIONS",
    "Location": "Bengaluru",
    "Experience Required": "0 Yrs",
    "Salary": "3.25 Lacs PA",
    "Application Type": "Internal",
    "Job URL": "https://www.naukri.com/job-listings-associate-software-engineer-coedloite-global-solutions-bengaluru-0-to-0-years-220425008983",
    "Scraped Date": "2025-05-04T03:37:07.787Z",
    "Skills": "Java Fullstack, Node.Js, MongoDB, React.Js, Java, Full Stack, Software",
    "Job Description": "Roles & Responsibilities:\nFull Stack Development:\nDesign, develop, test, and deploy scalable web applications using the MERN stack (MongoDB, Express.js, React.js, Node.js) and/or Angular frameworks.\nMaintain front-end and back-end components and ensure seamless integration between client-side and server-side logic.\nAPI Development & Integration:\nDevelop RESTful APIs and ensure robust integration with external/internal services.\nOptimize APIs for maximum speed and scalability.\nDatabase Management:\nDesign and manage databases using MongoDB.\nEnsure high performance and responsiveness to requests from the front end.\nDebugging & Troubleshooting:\nIdentify, troubleshoot, and resolve performance bottlenecks and bugs in both frontend and backend codebases.\nCode Quality & Best Practices:\nWrite clean, maintainable, and well-documented code following industry best practices and coding standards.\nParticipate in code reviews and contribute to team knowledge sharing.\nAgile Collaboration:\nWork in an Agile/Scrum environment with cross-functional teams to deliver high-quality software solutions.\nCommunicate effectively with team members, stakeholders, and managers.\nVersion Control:\nUse Git for version control and collaborate using platforms like GitHub or Bitbucket.\nContinuous Learning:\nStay updated with emerging technologies, frameworks, and industry trends.\nPreferred Candidate Profile:\nEducational Background:\nBachelors degree in Computer Science, Information Technology, or a related field.\nTechnical Skills:\nProficient in JavaScript, HTML5, CSS3, and modern web technologies.\nHands-on experience with MERN Stack – MongoDB, Express.js, React.js, Node.js.\nProficiency in Angular (version 8 and above).\nExperience in creating and managing RESTful APIs.\nFamiliar with Git, GitHub, or Bitbucket for version control.\nGood understanding of database concepts and working knowledge of MongoDB."
  },
  {
    "Job Title": "React Developer - Intern",
    "Company Name": "Corover",
    "Location": "Bengaluru(Kudlu Gate)",
    "Experience Required": "0 Yrs",
    "Salary": "60,000-1.25 Lacs PA",
    "Application Type": "Internal",
    "Job URL": "https://www.naukri.com/job-listings-react-developer-intern-corover-bengaluru-0-to-0-years-140425013306",
    "Scraped Date": "2025-05-04T03:37:22.833Z",
    "Skills": "React.Js, Restfull Api, Css/Css3, GIT, Github, Javascript, HTML, Postman",
    "Job Description": "Develop responsive user interfaces using React and modern frontend libraries.\nConvert Figma/mockups into functional, performant components.\nWork closely with the backend/AI teams to integrate RESTful and GraphQL APIs.\nOptimize UI performance for speed and scalability.\nWrite clean, maintainable code with attention to reusability and best practices.\nContribute to component libraries and design systems.\nRequired Skills & Software Stack:\nLanguages & Frameworks:\nReact.js (strong understanding)\nJavaScript (ES6+) & TypeScript\nHTML5, CSS3, SCSS\nUI/UX & Libraries:\nTailwind CSS / Material UI / shadcn/ui\nFigma (basic proficiency for reading designs)\nReact Router / Zustand / Redux Toolkit (any one)\nBuild & Tooling:\nVite / Webpack / CRA\nGit & GitHub for version control\neslint / prettier for code formatting\nAPI Integration:\nRESTful APIs\nGraphQL (optional, good to have)\nPostman / Swagger for testing\nBonus (Good to Have):\nFamiliarity with Next.js\nUnderstanding of responsive design & accessibility\nExperience with animations (Framer Motion or GSAP)\nBasic backend/API knowledge (Node.js / Firebase)\nWho You Are:\nCurrently pursuing/completed a degree in CS, Design, or a related field.\nStrong eye for design and user interaction.\nKeen to learn, iterate, and build real-world applications.\nComfortable working in collaborative and agile environments.\nWhat Youll Gain:\nExperience building production-grade React apps.\nExposure to AI-driven UI/UX challenges.\nLearn from experienced UI/UX and full-stack developers.\nLetter of Recommendation & opportunity for PPO based on performance."
  },
  {
    "Job Title": "Various opening For PwD (Person with Disability)",
    "Company Name": "Giftabled Innoventures",
    "Location": "Hyderabad, Bengaluru, Delhi / NCR",
    "Experience Required": "0-5 Yrs",
    "Salary": "Not disclosed",
    "Application Type": "Internal",
    "Job URL": "https://www.naukri.com/job-listings-various-opening-for-pwd-person-with-disability-giftabled-innoventures-hyderabad-bengaluru-delhi-ncr-0-to-5-years-090125010689",
    "Scraped Date": "2025-05-04T03:38:30.029Z",
    "Skills": "IT Skills, Non It Skills, Ux Design, Ui/Ux, Java, Backend Development, Software Product Development, Fullstack Development, Software Engineering, Frontend Development, Java Development, Product Engineering, Python Development, Customer Support Operations",
    "Job Description": "Diversity Hiring (PwD - Person with Disability) Only\n\nWe are currently looking for qualified PwD candidates to fill the following positions across departments in top companies pan India. If you are passionate about IT and Non IT, driven to make a difference, and eager to be part of a team that embraces diversity, we encourage you to apply.\n\nWe are inviting PwD to join us in a variety of roles across departments:\nTech Positions:\nSoftware Engineer\nData Scientist\nCloud Engineer\nArtificial Intelligence Engineer\nCybersecurity Specialist\nDevOps Engineer\nFull Stack Developer\nMachine Learning Engineer\nSystem Administrator\nNetwork Engineer\nDatabase Administrator\nIT Project Manager\nMobile App Developer\nFront-End Developer\nBack-End Developer\nIT Support Specialist\nUI/UX Designer\nBlockchain Developer\nQA Analyst\n\nNon-Tech Positions:\nHuman Resources Manager\nMarketing Specialist\nContent Writer\nSales Executive\nCustomer Service Representative\nOperations Manager\nBusiness Analyst\nFinancial Analyst\nProject Coordinator\nLegal Advisor\nAdministrative Assistant\nProduct Manager\nSupply Chain Manager\nPublic Relations Officer\nTraining and Development Manager\nExecutive Assistant\nRecruiter\nEvent Coordinator"
  },
  {
    "Job Title": "Python Developer",
    "Company Name": "Corover",
    "Location": "Bengaluru",
    "Experience Required": "0-1 Yrs",
    "Salary": "3-4 Lacs PA",
    "Application Type": "Internal",
    "Job URL": "https://www.naukri.com/job-listings-python-developer-corover-bengaluru-0-to-1-years-020425022183",
    "Scraped Date": "2025-05-04T03:38:37.563Z",
    "Skills": "Cloud Platforms, SQL Database, API, Nosql Databases, Python Development, Ubuntu, debug, Debugging, coding, GIT, Docker, Linux, GCP, Azure Cloud, Django, Centos, AWS, Restful Web Api Development, Flask, Kubernetes",
    "Job Description": "We are looking for a skilled Python Developer to join our team. The ideal candidate will be responsible for developing, testing, and maintaining Python-based applications. You will work closely with cross-functional teams to build scalable and efficient solutions.\n\nKey Responsibilities:\nDesign, develop, and maintain Python-based applications, scripts, and APIs.\nWrite clean, efficient, and scalable code following best practices and coding standards.\nTroubleshoot, debug, and optimize applications to ensure high performance and reliability.\nIntegrate third-party APIs, services, and databases seamlessly into applications.\nCollaborate with frontend developers, designers, and cross-functional teams to deliver high-quality solutions.\nImplement unit tests, write documentation, and ensure high test coverage for robust applications.\nManage and deploy applications in Linux-based environments, ensuring smooth operation and optimization.\nStay up-to-date with industry trends, emerging technologies, and advancements in Python development.\nContribute to architectural decisions and participate in code reviews to ensure code quality and best practices.\n\nRequired Skills & Qualifications:\nStrong proficiency in Python and its frameworks (Django, Flask, FastAPI, etc.).\nHands-on experience in building and consuming RESTful APIs and web services.\nSolid understanding of SQL and NoSQL databases (PostgreSQL, MySQL, MongoDB, etc.).\nProficiency in version control systems like Git and collaborative workflows (GitHub/GitLab/Bitbucket).\nExperience with Linux operating systems (Ubuntu, CentOS, etc.), including shell scripting, process management, and system troubleshooting.\nUnderstanding of asynchronous programming, multi-threading, and performance optimization.\nFamiliarity with cloud platforms (AWS, GCP, or Azure) and cloud-native services is a plus.\nExperience with containerization tools (Docker, Kubernetes) and CI/CD pipelines for automated deployments.\nUnderstanding of security best practices, authentication, and authorization mechanisms."
  },
  {
    "Job Title": "Associate Software Engineer",
    "Company Name": "Dealersocket",
    "Location": "Hyderabad, Bengaluru",
    "Experience Required": "0-1 Yrs",
    "Salary": "Not disclosed",
    "Application Type": "Internal",
    "Job URL": "https://www.naukri.com/job-listings-associate-software-engineer-dealersocket-hyderabad-bengaluru-0-to-1-years-310125023989",
    "Scraped Date": "2025-05-04T03:38:45.184Z",
    "Skills": "Java, SOA, iOS, .net, frontend, Design Patterns, Data Structures, OOPS, Problem Solving, SDLC Life Cycle, designing, Android, coding, Communication Skills, Algorithms, Mobile Applications, Solid Principles",
    "Job Description": "Role & responsibilities\nDesign and implement software solutions for an approved and assigned project which may target a new product or alternatively a major re-release of an existing product following the software development lifecycle.\nDocument and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code. Deliver on the product roadmap. Participate in technical planning and design reviews for feature development.\nBuild software that works well (quality), stable and secure. Understand the defined scope of the requirement / bug. Will work across multiple projects at once, looking for ways to enable collaboration.\nShould learn new development constructs related to the technology used in the product with an objective to improve his/her productivity and to improve the robustness of the product.\nParticipating in analysis and design meetings for the Product. Work as an active and collaborative member of a Scrum team.\nParticipate in all scrum ceremonies with team to review Technical Design Specifications, obtain development tasks, track progress, clarify technical issues pertaining to coding and testing of the design.\nIdentify and implement ways to improve quality and efficiencies in the department. Strong analysis and communication skills. Able to manage conflict and misalignment within the team and with the business.\nInteract with software architects and senior developers to design application modules using object-oriented design methods.\nDesign and develop software with high quality and take ownership. Work collaboratively in an Agile team\n\nPreferred candidate profile\nFreshers with 2023-2025 passout.\nB-Tech / MTech in Computer science or Information Technology\nHands-on with Design, Coding, Debugging and Testing -Strong troubleshooting and problem-solving skills.\nDevelopment skills and overall understanding of software development methodologies .\nVery good in Algorithms, Data structures, and Time Complexities, OOPS and Design patterns.\nGood communication and interpersonal skills; able to communicate technical concepts to non-technical groups .\nExcellent analytical and problem-solving skills. Ability to assimilate new product knowledge quickly and easily.\nExhibits focus, diligence, and discipline. Ability to adapt to changes quickly and easily."
  }
]