[
  {
    "_id": "68171a45f8e721138d29a2c0",
    "Job URL": "https://www.naukri.com/job-listings-software-engineer-scribble-data-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-0-to-1-years-010323500468",
    "Application Type": "External",
    "Company Name": "Scribble Data",
    "Experience Required": "0-1 Yrs",
    "Job Description": "We are searching for a strong software engineer with a data engineering bent of mind to work on our flagship feature store product, Enrich. You will work on extending functionality for Enrich as well as delivering working systems atop Enrich for Scribble s customers with high attention-to-detail ensuring trust, robustness, performance, and ease of use. Here are all the details you ll need, to see if we can work together:\n\nYou will develop high-performance data processing systems for dealing with internet-scale data.\nYou will develop and deploy robust, distributed, scalable, real-time, data processing infrastructure that can support various downstream applications including reporting, analytics, user intelligence, machine learning, and decision support.\nYou have strong software engineering skills, system-level thinking and problem-solving ability paired with the love to build and ship robust code.\nYou accept nothing less than top-quality code and think in terms of code reviews, unit, integration, end to end tests in a fast-moving development environment, delivering incremental value daily.\n\nYour Strengths\n5 years industry experience; plus points if any of those were spent building data infrastructure\nFluent in Python; you know the language and its quirks, not having just written scripts\nStrong command of SQL\nStrong understanding of computer science concepts (OOD, algorithm design, data structures, execution and memory optimization)\nExperience developing and publishing APIs using web services\nPlus points for experience implementing systems for data workflow management\nBachelors/Masters in Computer Science\n\nNice to Have\nExperience using at least some among distributed storage (e.g. S3), serverless architecture (e.g. Lambda), streaming data (e.g. Kafka), scalable search (e.g. Elasticsearch)\nExperience with big data technologies like map-reduce, NoSQL, Spark, HBase, Hive\nExperience with data security protocols and data access controls\n\nDoes this sound like you?\nYou like adventure and have a stomach for learning and unlearning every day\nYou are excited by powering up a whole generation of upcoming data applications\nYou dream big and believe that hard problems need streamlined systems and massive amounts of data to tackle effectively\nYou embrace uncertainty and can develop processes and systems to handle rapidly evolving requirements\nYou have a sense of humour",
    "Job Title": "Software Engineer",
    "Location": "Hyderabad, Pune, Chennai, Mumbai, Bengaluru, Kolkata, New Delhi",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T07:30:26.166Z",
    "Search Experience": "0",
    "Search Location": "Mumbai",
    "Search Query": "Software Engineer",
    "Skills": "metadata, Publishing, data security, Machine learning, Data structures, Analytics, SQL, Python, HBase",
    "firstScraped": "2025-05-04T07:41:57.146Z",
    "lastUpdated": "2025-05-04T07:41:57.146Z"
  },
  {
    "_id": "68171a45f8e721138d29a2c1",
    "Job URL": "https://www.naukri.com/job-listings-ai-software-engineer-godigi-infotech-mumbai-new-delhi-pune-bengaluru-0-to-1-years-100524500130",
    "Application Type": "External",
    "Company Name": "Godigi Infotech",
    "Experience Required": "0-1 Yrs",
    "Job Description": "We are on the lookout for a passionate Artificial Intelligence Engineer to be a part of our dynamic team.In this role, your curiosity and deep interest in AI, machine learning, and keeping pace with a rapidly evolving field will guide your path. You will delve into extensive data sets, identify patterns, and craft predictive algorithmic models, contributing to innovative projects.\nIf your a tech-savvy innovator with a drive to make a significant impact in the realm of AI, were eager for you to bring your talents to our team\n  AI Engineer Responsibilities\nDesign and develop cutting-edge AI solutions and systems that integrate with our products and services\nCollaborate with cross-functional teams to assess business needs and identify opportunities for AI solutions\nImplement and maintain AI models, algorithms, and tools\nConduct research and experiments to improve the performance of AI systems\nDevelop and maintain documentation for AI models and algorithms\nMonitor the performance of AI systems and make recommendations for improvements\nStay up-to-date with advancements in AI technologies and make recommendations for future development\nAI Engineer Requirements and Skills\nBachelors degree in Computer Science, Engineering, or a related field\nExperience in developing and deploying AI solutions\nProven track record of designing and implementing complex machine learning algorithms and models\nStrong programming skills in Python, R, MATLAB, or other relevant programming language\nExperience working with large datasets and data pre-processing techniques\nStrong problem-solving and analytical skills\nExcellent communication and collaboration skills",
    "Job Title": "AI Software Engineer",
    "Location": "Pune, Mumbai, Bengaluru, New Delhi",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T07:30:34.068Z",
    "Search Experience": "0",
    "Search Location": "Mumbai",
    "Search Query": "Software Engineer",
    "Skills": "Analytical skills, C++, Artificial Intelligence, Machine learning, Programming, Javascript, PHP, MATLAB, Python",
    "firstScraped": "2025-05-04T07:41:57.146Z",
    "lastUpdated": "2025-05-04T07:41:57.146Z"
  },
  {
    "_id": "68171a45f8e721138d29a2c2",
    "Job URL": "https://www.naukri.com/job-listings-software-engineer-voice-ai-kannada-soundhound-kolkata-mumbai-new-delhi-hyderabad-pune-chennai-bengaluru-0-to-3-years-050225503611",
    "Application Type": "External",
    "Company Name": "Soundhound",
    "Experience Required": "0-3 Yrs",
    "Job Description": "We are looking for a Software Engineer with native-level proficiency in speaking Kannada and an interest in creating user-friendly VoiceAI products using C++. You will learn and apply the most advanced technologies in the fields of Natural Language Processing (NLP), Natural Language Understanding (NLU), Natural Language Generation (NLG), speech, and search, all built in-house at SoundHound. Prior experience in these specialized fields is not required.\n  In this role, you will:\nSimultaneously leverage your coding skills and your knowledge of the Kannada language\nDevelop Conversational AI leveraging a powerful domain-oriented development paradigm\nImplement and scale core code base, solving both algorithmic and design challenges\nWrite code that interacts with third-party API s\nCollaborate closely with engineers who are building similar features for a variety of languages\nWe would love to hear from you if:\nYou have a Bachelors Degree in Computer Science and at least 2 years of experience as a Software Engineer OR a Master s Degree in Computer Science\nYou have excellent coding skills in C++ and at least one scripting language\nYou design unit and integration tests and maintain rigorous standards for code quality\nYou speak Kannada on a native-like level and are fluent in English\nYou are passionate about working at the intersection of software engineering and linguistics\nYou have experience designing efficient architectures, algorithms, and interfaces\nYou enjoy working on complex, open-ended challenges and improving existing solutions\nYou re comfortable working in a Linux environment\nWe d be especially excited if you have built chatbots or voice assistants or have experience with NLP algorithms",
    "Job Title": "Software Engineer, Voice AI (Kannada)",
    "Location": "Hyderabad, Pune, Chennai, Mumbai, Bengaluru, Kolkata, New Delhi",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T07:31:10.150Z",
    "Search Experience": "0",
    "Search Location": "Mumbai",
    "Search Query": "Software Engineer",
    "Skills": "C++, Linux, Coding, Linguistics, HTML, Natural language processing, Customer service, Process",
    "firstScraped": "2025-05-04T07:41:57.146Z",
    "lastUpdated": "2025-05-04T07:41:57.146Z"
  },
  {
    "_id": "68171a45f8e721138d29a2c3",
    "Job URL": "https://www.naukri.com/job-listings-software-engineer-zeki-software-solutions-pvt-ltd-mumbai-0-to-3-years-211222501679",
    "Application Type": "External",
    "Company Name": "Zeki Software",
    "Experience Required": "0-3 Yrs",
    "Job Description": "working Knowledge in web technologies and MYSQL ( HTML 5, CSS 3, Java Script, JQuery)\nFresher with good knowledge of OOPs and MySQL.\nBasic understanding of front-end/UI technologies.\nMust be able to write - clean, well designed code.\nGood Analytical and Communication skills is a must.\nDevelop a deep understanding of integration and dependencies with other systems and platforms within the architecture landscape.\nSkills\nPHP\nHTML\nCSS\nJQUERY\nMySql\nAjax\nJavascript",
    "Job Title": "Software Engineer",
    "Location": "Mumbai",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T07:31:18.188Z",
    "Search Experience": "0",
    "Search Location": "Mumbai",
    "Search Query": "Software Engineer",
    "Skills": "CSS, jQuery, Front end, Web technologies, Analytical, MySQL, Javascript, PHP, HTML, Ajax",
    "firstScraped": "2025-05-04T07:41:57.146Z",
    "lastUpdated": "2025-05-04T07:41:57.146Z"
  },
  {
    "_id": "68171a45f8e721138d29a2c4",
    "Job URL": "https://www.naukri.com/job-listings-software-engineer-zeki-software-solutions-pvt-ltd-mumbai-0-to-3-years-211222501676",
    "Application Type": "External",
    "Company Name": "Zeki Software",
    "Experience Required": "0-3 Yrs",
    "Job Description": "Working Knowledge in web technologies and MYSQL ( HTML 5, CSS 3, Java Script, JQuery)\nWorking Knowledge in Tomcat and WildFly web server is needed. .\nFresher with good knowledge of OOPs and MySQL.\nMust be able to write - clean, well designed code.\nGood Analytical and Communication skills is a must.\nSkills\nJava\nJSP\nServlet\nStruts\nJDBC\nOracle/MySql\nAjax",
    "Job Title": "Software Engineer",
    "Location": "Mumbai",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T07:31:26.074Z",
    "Search Experience": "0",
    "Search Location": "Mumbai",
    "Search Query": "Software Engineer",
    "Skills": "Object oriented design, Tomcat, jQuery, JSP, Analytical, MySQL, Struts, JDBC, Oracle, Ajax",
    "firstScraped": "2025-05-04T07:41:57.146Z",
    "lastUpdated": "2025-05-04T07:41:57.146Z"
  },
  {
    "_id": "68171a45f8e721138d29a2c5",
    "Job URL": "https://www.naukri.com/job-listings-software-engineer-balasundaram-santosh-pune-chennai-mumbai-all-areas-0-to-5-years-040824001469",
    "Application Type": "Internal",
    "Company Name": "Leading IT Company",
    "Experience Required": "0-5 Yrs",
    "Job Description": "Develop and maintain web applications.\nCollaborate with teams to design, develop, and deploy new features.\nDebug and troubleshoot issues.\nStrong problem-solving skills and attention to detail.\nFreshers & Experienced can apply.",
    "Job Title": "Software Engineer",
    "Location": "Pune, Chennai, Mumbai (All Areas)",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T07:32:46.485Z",
    "Search Experience": "0",
    "Search Location": "Mumbai",
    "Search Query": "Software Engineer",
    "Skills": "Software Development, Software Engineering, CSS, Software Testing, Software Life Cycle, PHP, Nextjs, Software Programming, Software Solutions, Python, SQL",
    "firstScraped": "2025-05-04T07:41:57.146Z",
    "lastUpdated": "2025-05-04T07:41:57.146Z"
  },
  {
    "_id": "68171a45f8e721138d29a2c6",
    "Job URL": "https://www.naukri.com/job-listings-tr-as-software-engineer-mern-stack-logixal-cloud-solutions-mumbai-all-areas-0-to-2-years-020525017985",
    "Application Type": "Internal",
    "Company Name": "Logixal Cloud Solutions",
    "Experience Required": "0-2 Yrs",
    "Job Description": "App development on UI platform using React-Typescript-JavaScript\nBackend development using Node/ExpressJS\nCreating & Consuming SOAP/RESTful webservices\nStrong fundamentals – OOPS concepts, Exception Handling, Coding Standards\nWorking in SDLC/Agile\n\nRequired Candidate profile\nTech graduate with Min 6 months exp in UI using JS, ReactJS & Typescript\nHands on exp in Node/ExpressJS\nExcellent analytical skills\nExp in NextJS would be an added advantage\n\nCan join immediately",
    "Job Title": "Tr/As Software Engineer (MERN Stack)",
    "Location": "Mumbai (All Areas)",
    "Salary": "Not disclosed",
    "Scraped Date": "2025-05-04T07:37:45.762Z",
    "Search Experience": "0",
    "Search Location": "Mumbai",
    "Search Query": "Software Engineer",
    "Skills": "Typescript, Javascript, Node.Js, React.Js, Mern Stack, Software engineering, Tr, As",
    "firstScraped": "2025-05-04T07:41:57.146Z",
    "lastUpdated": "2025-05-04T07:41:57.146Z"
  },
  {
    "_id": "68171a45f8e721138d29a2c7",
    "Job URL": "https://www.naukri.com/job-listings-erp-software-engineer-mastersoft-erp-solutions-mumbai-all-areas-0-to-3-years-310325005720",
    "Application Type": "Internal",
    "Company Name": "Mastersoft Erp Solutions",
    "Experience Required": "0-3 Yrs",
    "Job Description": "Understand the project by considering every aspect of each module of ERP\nImplementation of project at client site\nTraining of users according to modules\nOnsite support to clients\n\nRequired Candidate profile\nExcellent communication skills.\nExperience in software Implementation (Preferred).\nMale candidates are preferred.",
    "Job Title": "ERP Software Engineer",
    "Location": "Mumbai (All Areas)",
    "Salary": "2.5-5 Lacs PA",
    "Scraped Date": "2025-05-04T07:40:38.783Z",
    "Search Experience": "0",
    "Search Location": "Mumbai",
    "Search Query": "Software Engineer",
    "Skills": "Communication Skills, Customer Support, ERP Implementation, Technical Support, Presentable, Technical, Software, ERP",
    "firstScraped": "2025-05-04T07:41:57.146Z",
    "lastUpdated": "2025-05-04T07:41:57.146Z"
  }
]